app/controllers/todos_controller.rb

  def create

    @todo = current_user.todos.create!(todo_params)
---
INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "learn elm"], ["created_by", "1"], ["created_at", 2017-03-05 23:15:08 UTC], ["updated_at", 2017-03-05 23:15:08 UTC]]